In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

pd.options.display.float_format = '{.1f}'.format

In [2]:
df = pd.read_csv('US_baby_names.csv')
print(df.shape)
df

(2052781, 4)

         Year      Names Gender  Count
0        1880       Mary      F   7065
1        1880       Anna      F   2604
2        1880       Emma      F   2003
3        1880  Elizabeth      F   1939
4        1880     Minnie      F   1746
...       ...        ...    ...    ...
2052776  2021     Zyeire      M      5
2052777  2021       Zyel      M      5
2052778  2021      Zyian      M      5
2052779  2021      Zylar      M      5
2052780  2021        Zyn      M      5

[2052781 rows x 4 columns]

In [3]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2052781 entries, 0 to 2052780
Data columns (total 4 columns):
 #   Column  Dtype
---  ------  -----
 0   Year    int64
 1   Names   object
 2   Gender  object
 3   Count   int64
dtypes: int64(2), object(2)
memory usage: 62.6+ MB

In [4]:
df.nunique()

Year         142
Names     101338
Gender         2
Count      13854
dtype: int64

In [5]:
# Because gender has only two values we opt to change it to 'category'

df.Gender = df.Gender.astype('category')

In [7]:
# This step made the memory reduce from 62.6 mb to 48.9 mb

df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2052781 entries, 0 to 2052780
Data columns (total 4 columns):
 #   Column  Dtype
---  ------  -----
 0   Year    int64
 1   Names   object
 2   Gender  category
 3   Count   int64
dtypes: category(1), int64(2), object(1)
memory usage: 48.9+ MB

In [8]:
# Inspecting the most popular names in 2021

df_2021 = df[df.Year == 2021].copy()
df_2021

         Year      Names Gender  Count
2021244  2021     Olivia      F  17728
2021245  2021       Emma      F  15433
2021246  2021  Charlotte      F  13285
2021247  2021     Amelia      F  12952
2021248  2021        Ava      F  12759
...       ...        ...    ...    ...
2052776  2021     Zyeire      M      5
2052777  2021       Zyel      M      5
2052778  2021      Zyian      M      5
2052779  2021      Zylar      M      5
2052780  2021        Zyn      M      5

[31537 rows x 4 columns]

In [9]:
df_2021[df_2021.Gender == 'F'].nlargest(10, 'Count')

         Year      Names Gender  Count
2021244  2021     Olivia      F  17728
2021245  2021       Emma      F  15433
2021246  2021  Charlotte      F  13285
2021247  2021     Amelia      F  12952
2021248  2021        Ava      F  12759
2021249  2021     Sophia      F  12496
2021250  2021   Isabella      F  11201
2021251  2021        Mia      F  11096
2021252  2021     Evelyn      F   9434
2021253  2021     Harper      F   8388

In [10]:
df_2021[df_2021.Gender == 'M'].nlargest(10, 'Count')

         Year     Names Gender  Count
2038788  2021      Liam      M  20272
2038789  2021      Noah      M  18739
2038790  2021    Oliver      M  14616
2038791  2021    Elijah      M  12708
2038792  2021     James      M  12367
2038793  2021   William      M  12088
2038794  2021  Benjamin      M  11791
2038795  2021     Lucas      M  11501
2038796  2021     Henry      M  11307
2038797  2021  Theodore      M   9535

In [13]:
# Defining a function to choose easy the names and gender of each year

def most_commom(year, gender, n):
    return df[(df.Year == year) & (df.Gender == gender)].nlargest(n, 'Count')

In [27]:
most_commom(2010, 'F', 10)

         Year     Names Gender  Count
1658307  2010  Isabella      F  22925
1658308  2010    Sophia      F  20648
1658309  2010      Emma      F  17354
1658310  2010    Olivia      F  17030
1658311  2010       Ava      F  15436
1658312  2010     Emily      F  14278
1658313  2010   Abigail      F  14250
1658314  2010   Madison      F  13189
1658315  2010     Chloe      F  11757
1658316  2010       Mia      F  10644

Most commons names that stands the test of time

In [31]:
most_commom(2021, 'F', 10)

         Year      Names Gender  Count
2021244  2021     Olivia      F  17728
2021245  2021       Emma      F  15433
2021246  2021  Charlotte      F  13285
2021247  2021     Amelia      F  12952
2021248  2021        Ava      F  12759
2021249  2021     Sophia      F  12496
2021250  2021   Isabella      F  11201
2021251  2021        Mia      F  11096
2021252  2021     Evelyn      F   9434
2021253  2021     Harper      F   8388

In [29]:
most_commom(1880, 'F', 10)

   Year      Names Gender  Count
0  1880       Mary      F   7065
1  1880       Anna      F   2604
2  1880       Emma      F   2003
3  1880  Elizabeth      F   1939
4  1880     Minnie      F   1746
5  1880   Margaret      F   1578
6  1880        Ida      F   1472
7  1880      Alice      F   1414
8  1880     Bertha      F   1320
9  1880      Sarah      F   1288

In [35]:
f_2021 = most_commom(2021, 'F', 50)
f_1880 = most_commom(1880, 'F', 50)

In [36]:
f_2021[['Names', 'Count']].merge(f_1880[['Names', 'Count']], how='inner', on='Names')

       Names  Count_x  Count_y
0       Emma    15433     2003
1  Elizabeth     7190     1939
2       Ella     6987     1156
3      Grace     5486      982
4       Lucy     4433      590

In [37]:
f_2021[['Names', 'Count']].merge(f_1880[['Names', 'Count']], how='inner', on='Names', suffixes=['_2021', '_1880'])

       Names  Count_2021  Count_1880
0       Emma       15433        2003
1  Elizabeth        7190        1939
2       Ella        6987        1156
3      Grace        5486         982
4       Lucy        4433         590

In [38]:
m_2021 = most_commom(2021, 'M', 50)
m_1880 = most_commom(1880, 'M', 50)

In [39]:
m_2021[['Names', 'Count']].merge(m_1880[['Names', 'Count']], how='inner', on='Names', suffixes=['_2021', '_1880'])

       Names  Count_2021  Count_1880
0      James       12367        5927
1    William       12088        9532
2   Benjamin       11791         490
3      Henry       11307        2444
4     Daniel        9066         643
5    Michael        9041         354
6     Samuel        8501        1024
7      Jacob        8397         404
8       John        8130        9655
9     Joseph        8067        2632
10     David        7843         869
11    Thomas        6642        2534
12   Charles        5952        5348